PollsApp/app/models/response.rb

  def sibling_responses
    self.question.responses.where.not(id: self.id)
---
SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]